# установливаем образ версии Maven + название этапа сборки
FROM maven AS builder
# путь к рабочему каталогу
#WORKDIR /monster-company
# копируем все файлы внутри каталога проекта в контейнер
COPY . .
# выполнить командную строку внутри контейнера: mvn clean package для сборки зависимостей в jar
# скипаем выполнение тестов, который нет пока
RUN mvn clean package -DskipTests

# используем многоступенчатую сборку
# исполняемый код меняется чаще, чем зависимости
FROM openjdk:17-jdk-alpine
ARG JAR_FILE=/target/*.jar
# копируем jar из мавен контейнера в контейнер с приложением
COPY --from=builder ${JAR_FILE} app.jar
# точка входа
# исполняемый файл, который будет запускаться при загрузке контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]